<template>
  <div class="margin-center about-container">
    <div class="about-container-inner">
      <el-tabs v-model="activeTab" @tab-click="updateTab">
        <template #tabBarExtraContent v-if="windowSize > 768">
          <!-- <img class="extrel-logo" src="../../assets/images/index/logo_web.png" /> -->
        </template>
        <el-tab-pane label="关于我们" name="aboutus">
          <div class="help-content">
            <div class="about-title">关于我们</div>
            <p>
              持有菲律宾 NorthCagayan (NCGAC) 博彩合法执照，总部位于菲律宾
              Makati 金融中心 PBCOM
              大厦。我们提供超过两百多款的经典在线老虎机游戏。并且提供比陆地赌场更高的赔率，玩累积彩金游戏您就有机会赢得超级大彩池和娱乐场大奖！为了确保游戏的公平性，在选择平台方面，东赢经过多方考察最终确定了业界最具公信力的第三方游戏机构PlayTech平台。东赢专业的客服团队每天为您提供24/7小时的热情服务；雄厚的资金和正规的财务团队，为您提供最快的取款体验。我们采用了目前最好的加密技术和防火墙系统保护您的安全、信息私隐，并保证您享受公平，公正的游戏。由于采用了企业级别的加密科技（1024位RSA密钥交
              换和
              448位blowfish），我们可以为您的数据提供比一般的商业级别的SSL更高的保护。这一科技目前被世界上主要的金融机构所采用。
            </p>
          </div>
        </el-tab-pane>
        <el-tab-pane label="财务帮助" name="finance">
          <div class="help-content">
            <div class="about-title">财务帮助</div>
            <div class="content-title">存款帮助</div>
            <div class="help-main-box">
              <div class="content-sub-title">1.在线存款：</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择支付银行”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会自动跳转到您的存款银行页面，您根据提示信息进行存款即可！
                （会生成一个以 “DY开头的存款编码”）
              </p>
              <div class="imgBox">
                <img
                  src="https://8fzka.latinovelas.com/resources/web_h5/images/help/help_5.png"
                />
              </div>
              <div class="content-sub-title">2.支付宝支付</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择支付宝支付”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会自动跳转到您的存款银行页面，您根据提示信息进行存款即可！
                （会生成一个以 “DY开头的存款编码”)
              </p>
              <div class="imgBox">
                <img
                  src="https://8fzka.latinovelas.com/resources/web_h5/images/help/help_6.png"
                />
              </div>
              <div class="content-sub-title">3.微信支付</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择微信支付”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会自动跳转到您的存款银行页面，您根据提示信息进行存款即可！
                （会生成一个以 “DY开头的存款编码”)
              </p>
              <div class="imgBox">
                <img
                  src="https://8fzka.latinovelas.com/resources/web_h5/images/help/help_7.png"
                />
              </div>
              <div class="content-sub-title">4.手机短信支付:</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择短信支付”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会自动跳转到您的存款银行页面，您根据提示信息进行存款即可！
                （会生成一个以 “XW开头的存款编码”)
              </p>
              <div class="content-sub-title">5.支付宝转账</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择支付宝快捷”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会弹出银行信息，您根据提示信息进行存款即可！
                （会生成一个以 “DY开头的存款编码”)
              </p>
              <div class="imgBox">
                <img
                  src="https://8fzka.latinovelas.com/resources/web_h5/images/help/help_8.png"
                />
              </div>
              <div class="content-sub-title">6.银行转账</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“选择银行转账”--&gt;
                “输入充值金额”--&gt;点击“存款”即可！页面会自动跳转到您的存款银行页面，您根据提示信息进行存款即可！
                （会生成一个以 “DY开头的存款编码”)
              </p>
            </div>
            <div class="content-title">提款帮助</div>
            <div class="help-main-box">
              <div class="content-sub-title">1.如何绑定银行卡及提款</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“取款”--&gt;
                “绑定银行”--&gt;填写银行信息 即可！
                再点击“申请提款”--&gt;选择提款银行--&gt;填写提款金额--&gt;提交成功
              </p>
              <div class="content-sub-title">2.银行解绑记录</div>
              <p>
                登陆账号后请您点击“出纳柜台”--&gt;“取款”--&gt;
                “绑定银行”--&gt;点击“解绑”--&gt;输入完整卡号即可解绑！
              </p>
            </div>
          </div>
        </el-tab-pane>
        <el-tab-pane label="隐私条款" name="privacy">
          <div class="help-content">
            <div class="about-title">隐私条款</div>
            <p>
              东赢将不断完善加密和防火墙技术工作，尊重您的私隐权并保证您数据的安全！
              <br />
              东赢绝对不会泄露您的个人资料给第三方，除非收到法庭传单或应可行法律的要求及判决。
              <br />
              我们有权通过网站向有关付款平台服务提供商以及金融保险机构提供必要的个人信息以完成付款要求。
              <br />
              东赢团队不容许发放垃圾邮件，并绝不会向您发送未经许可的电子邮件。您可能会收到一些定期的电邮，向您更新有关东赢产品的资讯和服务。当本网站推出新颖，好玩和有趣的优惠及活动，这些电邮就能帮助您不会错过网站的服务。
              <br />
              所有数据的内部出入都受到严格的限制及严密的监控。
              <br />
              东赢与我们的合作伙伴会通过邮件将您可能感兴趣的促销优惠的消息发送给您。
              <br />
              每位玩家亦有责任保护您的个人信息，保管好您的密码以免外泄，确保没有人能使用您的东赢账户。当您关闭东赢网站时，谨记注销或点击【x】以正常退出东赢网站。
            </p>
          </div>
        </el-tab-pane>
        <el-tab-pane label="责任博彩" name="service">
          <div class="help-content">
            <div class="about-title">服务条款</div>
            <p>
              请仔细阅读以下您与东赢有关的法律条款。请仔细阅读并确保您能完全理解其内容。如果您对条款约束的权利和义务有任何疑问，请联系管辖区所在地的律师。
            </p>

            <div class="about-title">定义</div>
            <p>
              “博彩”泛指通过网际网络可进行的游戏系统或/和网站提供，包括“娱乐场”和“真人百家乐”，也包括任何相关的服务和在线游戏活动的游戏系统或
              /和网站提供；
              <br />
              “博彩”就本条规而言，包括但不限于通过博彩网站提供的任何及 /
              或一切博彩服务进行的投注、游戏及各类博彩活动;
              <br />
              “连接设备”指任何应用连接设备，包括但不限于为使用和连接博彩网站、参与博彩服务而采用的个人电脑、笔记本电脑、移动电话、个人数码助理、
              PDA 电话、手提设备。
              <br />
              “博彩软件”指经监管机关批准的、安装在用户连接设备上的电脑程序、数据文件或任何其他资讯及信息内容
              ( 包括与之有关的任何用户信息 )
              ，以便用户通过用户连接设备使用、连接和参与在博彩网站上提供的博彩服务;
              <br />
              “服务”同时泛指软件和游戏； “您”，“你”
              或是“客户”泛指任何人使用网站或是东赢所提供的服务或/和任何注册于东赢的客户。
              <br />
            </p>

            <div class="about-title">同意</div>
            <p>
              用户在注册过程中于“本人确认本人已满 18 周岁，并已阅读、打印并同意
              东赢之本条规”字样之后的方框内打勾，并点击相应的“确认注册”按钮，即表示用户确认并同意：
              <br />
              用户已经阅读、完全理解并同意本条规;
              <br />
              本条规构成用户与东赢之间关于博彩服务使用的具有法律约束力的协议
              (“使用协议”) 。
              <br />
              如果用户不同意本条规中的任何条款，请勾“本人不同意”按钮，并请不要点击“确认注册”按钮，不要试图使用或继续使用任何博彩服务或下载和
              / 或安装博彩软件。
            </p>

            <div class="about-title">法律要求</div>

            <p>
              只有当您达到所居住国家法律规定的法定年龄，才能使用娱乐场和/或网站。
              <br />
              如果您未满 18 岁，在任何情况下均不得使用和/或网站。
              <br />
              有些法律管辖区并未声明在线赌博的合法性，而有些则明确规定在线赌博为非法。
              我们并未企图让法律禁止区域内的任何人使用娱乐场和/或网站。
              娱乐场和/或网站的可用性并不能解释为我们提供或鼓励您在任何国家（包括法律禁止的国家）内使用娱乐场。在适用法律所禁止的任何地方，均不得使用娱乐场。
              您同意单独负责确定在所居住国家使用娱乐场的合法性。如果我们认为您在使用在线娱乐场是违反了本条款，我们保留关闭玩家账户并进行补救性措施的权利。
            </p>

            <div class="about-title">资金交易</div>
            <p>
              为您提供24/所有使用信用卡或借记卡的用户，持卡人姓名须与会员账号申请过程中所使用的姓名一致。若发生持卡人姓名和会员账户申请所使用的姓名不一致的情况，东赢有权拒绝对于相关交易的结算。
              <br />
              用户承担向东赢/
              或其他用户（视具体情况而定）支付所有应付款项的一切责任。用户同意对任何付款不实施或促使他人实施退款，不拒绝或撤销付款，并向东赢偿付所有被退还、拒绝或撤销的付款以及由此引起的所有损失和费用。
              东赢根据自主判断，有权终止向个别用户或使用某类信用卡或借记卡付款的用户提供服务或支付款项。
              <br />
              您所得的彩金将存入您的账户中。但任何款项或彩金在存入账户的过程中发生错误，东赢不负任何形式的任何责任，且东赢有权在任何时候或在事后宣布涉及该笔款项的交易无效。用户一旦发现账户内款项汇存有误，有责任立即通知东赢且不可进行投注，东赢有权宣布用此资金的投注交易无效，并收回款项。同时，账户款项不可转存入其他账户。
              <br />
              在任何适用法律下就彩金所应缴付的税款和费用均由用户自行负责缴付。
            </p>

            <div class="about-title">修改</div>
            <p>
              我们保留不时修订、更新和修改本条规和博彩规则 ( 或其任何部分 )
              的绝对权利。上述任何修订、更新或修改将在博彩网站上公布。经修订、更新或修改的本条规和博彩规则与在博彩网站上公布时生效。用户在上述修订、更新或修改公布之后继续通过博彩网站和博彩设备使用、连接和参与博彩服务，视为用户同意并接受所公布的经修改或更新的本条规和博彩规则。
              <br />
              用户确认并同意，用户将自行负责查阅上述修订、更新和 / 或修改。
              东赢可自主决定是否将上述修订、更新和 /
              或修改通知用户。但东赢并无任何义务向用户通知上述上述修订、更新和修改。
            </p>

            <div class="about-title">博彩资讯和知识产权</div>
            <p>
              我们仅接受用户按本条规通过互联网和 /
              或连接设备进行下注。其他下注形式 ( 邮寄、电邮、传真等 )
              一概不予接受。我们即使收到其他形式的下注，不论赌盘最后开出的结果如何，均视为无效。
              <br />
              受限于本条规其他规定，用户输入正确的用户名和密码且账户内存有足够余额，用户的投注行为将被视作有效。
              <br />
              用户均须对使用下列内容（或其各项结合）所进行的所有活动和交易负责（无论下述使用是否得到授权）：
              <br />
              用户姓名；和 / 或
              <br />
              用户用户名；和 / 或
              <br />
              用户的用户名和密码。
              <br />
              用户自行负责确保其下注细节的准确性。用户需了解投注规则，包括了解此次下注所有的适用规则，以及在确认下注、将注单传送给我们前，检查投注内容是否有误。受限于本条规其他规定，一旦用户下注且我们确认接受用户的下注，即为用户下注的最终确证；用户不得取消、撤回下注或更改下注细节。
              <br />
              所有下注均将收录在交易记录数据库。东赢的交易记录将成为所有交易及下注的相关信息的最终确证。
              <br />
              收到款项的投注将被优先确认下注，（若未收到，我们保留取消此下注的权利）依据本条规其他规定，当交易代号出现在用户屏幕上并有效显示在用户的交易历史中时，下注即视为有效及被东赢接受。
              <br />
              客户必须个人下注，经相同或不同客户的重复投注将可能被怀疑有作弊嫌疑，特别是这些相似账户均为某一短时间内注册生成的。
            </p>
            <div class="about-title">领取彩金</div>
            <p>
              用户的彩金经结算后，将存入用户账户，具体提取办法参照我们彩金提取规定，若出现特殊情况，东赢有权要求您出示我们认可的有效带照身份证
              / 借记卡等证件。
              投注额必须达到存款额的一倍才能进行提款，东赢将保留权利，收取必要的提款和存款手续费。
              东赢因用户的博彩交易而蒙受的所有银行收费均由用户承担和偿付，东赢有权从用户彩金或账户中扣除和抵扣上述收费。
            </p>

            <div class="about-title">诚实游戏和下注</div>
            <p>
              犯罪行为：当我们有理由相信一个或是多个账户出现犯罪或是其他可疑活动时（包括，不限制于企图洗钱或是欺诈），我们保留权利关闭相关的账户。所有账户资金（包括存款和任何赢利）将被没收。
              <br />
              欺诈行为：在我们合理的酌处权下，如果我们确定任何玩家从事任何欺诈，不合法，不诚实或是不恰当的行为（包括，不限制于提供假信息或是蓄意误导有关详情），我们将保留权利立即终止或是限制客户登录其账户。在这样的情况下，所有账户里的余额（包括存款或是任何赢利）将全数没收。并且我们保留对有关当局公开有关信息的权利（包括客户的身份）。
              <br />
              拒绝任何客户协助程序：使用任何外挂客户协助程序(EPA程序 –
              玩家在不公平的情况下提高和对手的赢面的外挂程序)是全面禁止的。我们所定义的EPA程序包括电脑软件，或是非软件基础数据或是评论玩家的网站（像是国际网络信息和订阅相关服务）。所有有能力接触或是收集其他玩家资料而非通过第一手接触经验（像是观察游戏手法）将被视为'不公平'。我们保留在我们合理的酌处权下关闭相关使用外挂EPA程序的账户并没收所有赢利的权利。
              <br />
              拒绝“机器人”：所有在网站上的操作必须经由玩家通过所提供的网站界面来进行。我们实施全面监护来确保所有
              机器软件或是程序模拟真人游戏将被检查并阻止进入网站。任何账户被发现和类似活动有关联将会被审核或是账户被终止。在我们合理的酌处权下，如果我们确定任
              何账户使用类似软件，有关账户将被关闭而账户余额（包括存款和所有赢利）将全数没收。
              <br />
              共谋/勾结：任何玩家通过交换资料或是企图通过共谋合作所获得的不公平优势，而从中获得任何利益或是优势，这类型行为将视为共谋或是勾结，并将永久禁止使用此网站。在我们合理的酌处权下，如果我们确定任何账户被发现类似行为，我们将自行全权处理并关闭所有相关账户并没收所有资金（包括存款和任何赢利）。我们将严格地手动和自动式检查所有相关的活动，定期或是抽样检查。我们也将调查被投诉的玩家游戏记录和账户，可以是定期或是抽样检查。共谋包括，但不限制于共享手牌信息，渡让筹码，在游戏时讨论手牌（使用网站聊天系统或是外挂），多人使用同一个账户，故意让牌或是蓄意转筹码。
              <br />
              拒绝转让资金：根据我们的反洗黑钱条例，我们不允许/宽恕任何玩家账户之间转让资金。一旦玩家被发现所谓的转让资金或是渡让筹码，相关金额交易将被退回。而我们也保留关闭所有相关账户和没收账户资金（包括存款和赢利）的权利。
              <br />
              组织投注活动：一个玩家或是一组玩家通过合作的方式接受赢利或是红利活动，将被视为一个账户，而多余的账户将被关闭并融合于一个通过审核的账户（统称为组织投注）。
              我们保留向每个被视为重开的账征收费用来处理有关的交易转账的权利。多余的账户的投注交易将被视为无效。我们保留没收主账户的任何企图诈骗公司的红利金额的权利，即便是玩家独立操作或是和其他玩家合作或是任何生意形式的活动。
              <br />
              滥用红利活动：红利活动的目的是为了奖励消遣娱乐性的玩家而已。在我们自行合理的酌处权下发现任何专业的玩家或是任何玩家企图滥用红利活动或系统，我们保留将相关红利全数收回并实施其他处分的权利。滥用红利定义为（不限制）客户提款后目的为了再存款，或是自行开始新账户来索取红利。处分可以是增加投注倍数或是和所有关联的账户同时丧失获得其他红利的处分。我们保留在有必要时限制玩家领取红利的资格的权利。这包括（但不限制于）针对区域性的限制来领取红利，基于高度的滥用红利问题。更多详情，请查询红利政策。
              <br />
              东赢禁止一切对赌行为！如：在百家乐中同时投注“庄-闲”；轮盘中同时投注“黑-红”“大-小”“单-双”；龙虎中同时投注“龙-虎”；骰宝中同时投注“大-小”“单-双”等行为！若发现会员存在以上行为，东赢有权扣除账户全部盈利，在情节严重时，不返还本金并冻结账户及相关联账户！
            </p>

            <div class="about-title">补偿</div>
            <p>
              用户同意，由于用户连接博彩网站、下载或安装博彩软件、下注和 /
              或以其他方式使用博彩服务、博彩软件和 / 或博彩资讯、及 /
              或违背本条规和 / 或博彩规则，而对东赢、
              东赢的股东、雇员、管理人员、董事、受许可方、经销商、关联方、子公司和
              / 或代理商造成的任何损失、损害或及索赔 ( 包括合理的律师费 )
              ，用户须予以全额赔偿。
              <br />
              娱乐场（真人百家乐/老虎机）下注向任何会员支付的最高彩金为美金300,000（或我们根据我们银行所公布的汇率不时确定的其他等额货币。）
              <br />
              所有未存款会员若在存款前中了累积奖池，中奖奖池将视为无效（包括领取免费投注会员）
              <br />
              所有未存款会员在存款前最高提款上限为1000元。其余金额将视为无效（包括领取免费投注会员）。
              <br />
              终止、关户及暂停博彩服务
              <br />
              东赢如有充分理由相信或证明以下情形，除本条款项外东赢所享有的其他权利外，
              东赢有权，根据自主判断，宣布任何彩金无效并没收用户下注账户中所存余额、终止本协议和
              / 或暂停提供博彩服务 / 冻结和/或关闭用户账户：
              <br />
              用户在东赢拥有不止一个活动账户；
              <br />
              用户姓名与向东赢进行购卖或支付押金所用的信用卡或借记卡或其他付款账户的持有人姓名不符；
              <br />
              用户参与东赢促销并在未满足促销要求之前退出该促销；
              <br />
              用户提供不正确或误导性的注册信息；
              <br />
              用户未提供或遗漏提供必要的身份资料；
              <br />
              用户不满法定年龄；
              <br />
              用户连接和使用博彩服务所在的地区在法律上禁止使用博彩服务；
              <br />
              用户对我们实施或促使他人对我们实施 " 退款 "
              ，或否认以其账户名义进行的任何交易或押金；
              <br />
              用户押金来源于刑事犯罪或其他非法或未经授权的活动；
              <br />
              用户被发现欺诈或企图欺诈任何人或已经对任何人实施欺诈，或经东赢认定用户使用专门设计用以干扰
              / 捣毁系统之人工智能或其他系统 (
              包括机械、电脑、软件或其他自动化系统 )
              ，或被发现与其他博彩玩客勾结或企图与其他赌客勾结欺骗
              东赢或其他博彩玩客；
              <br />
              用户允许 ( 不论是否故意 ) 他人使用其账户；
              <br />
              用户未遵守本协议项下的任何使用规定；
              <br />
              用户未透露其在菲律宾、德国、美国、土耳其、马来西亚、台湾或其他我们据情况而定的区域境内的事实。
              <br />
              若我们暂停提供博彩服务和 / 或冻结账户，在用户实施必要的纠正措施 (
              如可以纠正 )
              ，且我们确认完全满意用户的纠正措施之后，博彩服务和用户账户将被恢复和解冻。
              <br />
              东赢保留在无进一步解释情况下关闭客户账户和退还账户余额的权利。而依照规则与条款的出色投注则将受到尊重。同时，我们保留因实际情况而无义务通知的情况下，单方面暂停全部或任何部分服务的权利。
            </p>

            <div class="about-title">与外部网站的链接</div>
            <p>
              博彩网站可能含有非东赢所维护的外部网站链接。此外部网站链接仅为方便用户而提供，东赢不能确保上述链接所含内容的准确性或时效性，且不作任何管制及不负任何责任。
              <br />
              东赢不会对外部网站的内容资讯，隐私保护政策或在外部网站宣传、出售或以其他方式开放的任何产品或服务承担任何责任、负责提供或审查、予以批准或核准、或作出任何声明与保证。
              <br />
              东赢不就用户因使用博彩网站所提供的任何外部网站链接而发生的或与之相关的任何损失或损害承担合约、侵权、疏忽或其他责任。
              <br />
              除非明文规定，否则东赢在任何情况下均不得被视为与外部网站上的任何声明、意见、产品或服务商标、标记、标志或其他图案、在外部网站宣传、出售或以其他方式开放的任何产品或服务、外部网站的经营者或所有者、或以任何方式与外部网站相关的任何人具有任何关系或联系。
            </p>

            <div class="about-title">违法本条规</div>
            <p>
              东赢保留就违反本条规的行为依法寻求救济（法律及衡平法）的权利，包括自行决定在任何时候基于任何理由拒绝或限制任何特定的人连接博彩服务、博彩网站和博彩资讯、阻止通过特定互联网地址或连接设备连接博彩服务、博彩网站和博彩资讯的权利。
            </p>

            <div class="about-title">不可抗力</div>
            <p>
              若东赢发生其下列无法控制的任何性质的事件 (
              包括但不限于天灾、适用法律法规的变更、政府、民政或军事机关的作为或不作为、法院命令、恐怖活动、闪电或火灾、罢工、停工或其他劳资纠纷、洪水、干旱、战争、暴乱、盗窃、传输或系统故障、通讯或宽带服务故障或中断、电力供应或设备故障或不足、恶劣气候、地震和自然灾害
              )
              未能或迟延履行本条规所规定的任何义务，不构成违反本条规。用户同意采取一切必要行动尽量减轻上述事件的后果。
            </p>

            <div class="about-title">弃权</div>
            <p>
              东赢在任何时候未能执行本条规任何条款不可视为东赢放弃本条规所规定的权利或以任何方式影响本条规全部或部分的有效性，且不影响东赢采取进一步行动的权利。
            </p>

            <div class="about-title">可分割性</div>
            <p>
              若任何条款或其任何部分被有关机关认定为在任何程度上无效、不合法或不可执行，则该条款或该部分在上述程度上与其他条款分割，其他条款在法律允许的范围内继续完全有效。
            </p>

            <div class="about-title">安全</div>
            <p>
              我们是遵照菲律宾的Cagayan Economic Zone
              Authority法律成立的一家公司，并受该国法律的完全授权和管辖
              <br />
              我们仅允许用户通过安全网络（采用用户名和密码的加密方式）在东赢游戏。未通过我们的客户安全登录的用户，将无法登陆游戏
              <br />
              不得将游戏用于任何商业用途或代表任何其他人。您使用游戏账号仅出于私人目的。
              <br />
              请对您的用户名和密码严格保密，不应将其透露给任何人。请不要使用其他人的密码。您应当对您用的密码和所有与您一同游戏的玩家帐户相关的交易活动负责。任何人只要正确输入了您的用户名和密码，我们都认为他/她就是您；正确输入了用户名和密码的所有交易都被视为有效。
              <br />
              您不应当允许任何第三方使用您的玩家帐户来登陆，且不应当使用任何其他人的玩家帐户或付款方式来访问游戏、网站或软件。
              <br />
              在玩此类游戏之前，您有责任确保了解游戏中和您使用的在线游戏的基本规则和步骤。
              <br />
              我们采用目前最先进的加密方法，对用户名和密码信息、往返于客户端应用程序和我们服务器之间的任何其它敏感信息进行加密，以防第三方试图操纵玩家和我们。您不得强行进入、访问或试图强行进入或访问、或以其它方式绕过我们的安全系统。如果我们怀疑您曾试图或可能正在试图强行进入、访问或以其它方式绕过我们的安全系统或软件，我们有权直接终止您对娱乐场的访问和/或冻结您的帐户，并保留告知相关法律机构的权利。
              <br />
              我们只是根据我们制定的完整的隐私政策来使用您的个人信息。我们保留随时修改隐私政策的权利。但是，我们保留要求您提供其它详细信息的权利，这些附加信息将被严格保密。我们还保留在特定情况下向相关机构透露特定信息的权利，但必须是根据法律或经国家权力机关或管理机构的要求才可以透露。根据隐私政策的规定，只有在法律规定的范围内公司才有权向以调查洗钱、诈骗和其它犯罪活动为目的的机构或权力机关透露个人信息。
            </p>

            <div class="about-title">免责声明及特别注意事项</div>
            <p>
              博彩完全是一项个人选择，以个人判断与分析为依据，且风险自负的行为。用户下注的同时，即表明用户承认博彩服务、博彩网站和博彩资讯并无冒犯性，且并不令人反感、不公平或有悖公共道德。一些司法管辖区对网上及
              /
              或岸外网上博彩的合法性尚无定论；而另一些司法管辖区则明确规定网上博彩（在司法管辖区域内和
              /
              或岸外）均属非法行为。我们不鼓励任何人在非法的情况下使用和连接博彩网站、博彩资讯和
              /
              或博彩服务。博彩服务、博彩资讯和博彩网站的设立和提供并不构成我们发出要约、招揽或邀请任何人在那些规定使用或连接上述内容为非法行为的国家内使用或连接上述内容。用户独立承担遵守其所适用之相关法律规定的责任，而
              东赢不就博彩服务、博彩软件、博彩网站或其中的博彩资讯与用户所适用的法律规定相符作出任何声明。
              <br />
              博彩服务、博彩软件、博彩网站和博彩资讯均按 " 原状原则 "
              提供。除本条规明示的外，东赢不就博彩服务、博彩网站、博彩软件和博彩资讯作出任何声明或保证。故所有有关博彩服务、博彩软件、博彩网站和博彩资讯的声明或保证，不论明示或暗示、法定与否，特此在法律允许的最大范围内予以排除。东赢不就博彩服务、博彩软件、博彩网站或博彩资讯的准确性、及时性、安全性、连续性、正确性或抗外界干扰性（任何性质），以及更正所发现的任何缺陷作出保证。东赢亦不保证博彩服务、博彩软件、博彩网站和博彩资讯或提供上述内容的服务器不含有任何病毒、间谍软件、广告软件或其他具恶意性、破坏性或可导致电脑瘫痪的代码、程序、数据、宏指令或可影响任何连接设备和
              /
              或其中所存数据的其他软件或特性。用户承诺将自行自费采取预防措施，确保其使用或连接博彩服务所用的过程、方法和
              /
              或连接设备、以及博彩软件的安装和博彩网站的使用，均不会带来电脑病毒、间谍软件、广告软件或具恶意性、破坏性或可导致电脑瘫痪的其他代码，或导致其连接设备或其中所存数据受到干扰和破坏的其他风险。
              <br />
              若发生与账户结算或博彩服务的其他方面有关的系统错误或通讯错误，
              东赢不承担由此引起的任何责任。在此情况下，
              东赢有权取消所有受上述错误影响的下注并采取任何更正行动。
              <br />
              在任何情况下，因用户连接、使用或参与博彩服务、博彩网站、博彩软件和博彩资讯而发生任何损害、损失或支出，包括用户之连接设备或所存数据受到任何干扰或破坏，东赢不承担任何责任。此外，对博彩服务、博彩网站、博彩软件和博彩资讯中由第三方
              ( 包括但不限于宽带和电信服务供应商 )
              所提供的内容，东赢亦不作任何保证和声明且不予负责；在任何情况下，东赢均不对上述第三方合作者的任何违约、过错或不作为承担责任。
              <br />
              在任何情况下，东赢、其关联公司、关联方、合伙人、管理人员、雇员和代理均不对任何损害、损失或支出承担责任，包括但不限于因用户连接或使用博彩服务、博彩网站、博彩软件和博彩资讯、或与用户连接或使用博彩服务、博彩网站、博彩软件和博彩资讯有关的、或因用户下载、安装或使用博彩软件所引起的任何直接、间接、因果性或特别的损害或经济损失，不论东赢是否被告知可能发生上述损害、损失或支出。在任何情况下，就与用户下注直接相关的任何事宜、事件或情形所引起或与之相关的任何损失或损害
              ( 不论是否基于合约、侵权、严格责任或其他原因 )
              ，在法律允许的最大范围内，东赢对用户的全部责任 ( 如有 )
              应不超过用户的相应下注额。
              <br />
              用户承认，博彩资讯在性质上可能全部或部分地具有临时性，并且可按本条规予以修订、修改或更改。因此，用户承认博彩资讯仅为参考之用，不构成任何建议、意见或招揽，不构成任何与
              东赢相关的具约束力的声明、保证、合约义务或用户依据的内容和基础。
              <br />
              用户特此承认并同意，在考虑所有相关因素，包括但不限于用户向东赢提供对价的价值后，本条规所述之所有责任豁免和义务排除代表用户和东赢协议中公平、合理的风险分担和利益分配。用户进一步同意上述免责和限制在适用法律允许的最大范围内具有强制执行力。
            </p>
          </div>
        </el-tab-pane>
        <el-tab-pane label="法律依据" name="terms">
          <div class="help-content">
            <div class="about-title">法律依据</div>
            <ol>
              <li><p>本隐私政策严格遵守相关数据保护法；</p></li>
              <li>
                <p>
                  只有当您达到所居住国家法律规定的法定年龄，才能使用娱乐场和/或网站
                </p>
              </li>
              <li>
                <p>如果您未满 18 岁，在任何情况下均不得使用和/或网站。</p>
              </li>
              <li>
                <p>
                  有些法律管辖区并未声明在线赌博的合法性，而有些则明确规定在线赌博为非法。
                </p>
              </li>
            </ol>
          </div>
        </el-tab-pane>
        <el-tab-pane label="联系我们" name="contactus">
          <div class="help-content">
            <div class="about-title">联系我们</div>
            <p>
              我们为您提供中/英文双语专业客服和团队为您提供24/7专业服务，
              您也可以随时通过以下方式联系我们：
              <br />
              客服邮箱：cs@dyvip99.com
              <br />
              市场部邮箱：affiliate@dyvip99.com
              <br />
              客服电话：
              <span class="customer_phone">852-81932110</span>
              <br />
              <!--客服QQ名称：东赢客服（唯一QQ）：<span class="customer_qq_number">2853531804</span><br>-->
              为您提供24/7全天候服务
              <br />
            </p>
          </div>
        </el-tab-pane>
      </el-tabs>
    </div>
  </div>
</template>
<script lang="js">
import { ref, onMounted, onUnmounted, defineComponent, watch } from "vue";
import { useRoute, useRouter } from "vue-router";

export default defineComponent({
  name: "AboutView",

  setup() {
    const activeTab = ref("aboutus")
    const route = useRoute();
    const router = useRouter();
    const windowSize = ref(window.innerWidth)
    onUnmounted(() => { window.removeEventListener('resize', () =>
    {windowSize.value = window.innerWidth}) })

    const updateTab = (pane) => {
      router.push({query: { id: pane.props.name }})
    }
    watch(() => route.query, () => {
      if (route.query === null) {
        activeTab.value === 'about'
      } else {
        activeTab.value = route.query.id; window.scrollTo(0, 0);
      }
      // Optionally you can set immediate: true config for the watcher to run on init
      // }, { immediate: true });
    });

    onMounted(() => {
      if (route.query.id) {
        activeTab.value = route.query.id;
      }
    window.addEventListener('resize', () => {windowSize.value = window.innerWidth} )
    });

    return {
      activeTab,
      windowSize,
      updateTab
    };
  }
});
</script>
<style lang="scss">
.about-container {
  // min-height: 1062px;
  min-height: calc(80vh);
  height: 570px;
  background: url(../assets/about/bg.png) no-repeat left top;
  background-position: -80px 0px;
  overflow: auto;
  scrollbar-width: none;
  &::-webkit-scrollbar {
    height: 1px;
    width: 1px;
  }
  .about-container-inner {
    max-width: calc($maxwidth - 150px);
    margin: 0 auto;
    margin-left: 500px;
  }

  .el-tabs .el-tabs__nav {
    float: none;
  }
  .el-tabs .el-tabs__item {
    text-align: left;
    margin: 10px 0;
  }
  .el-tabs .el-tabs__item.is-top {
    padding-left: 80px;
    line-height: 55px;
    display: block;
    margin: 20px 0;
  }
  .el-tabs--left .el-tabs__header.is-left,
  .el-tabs--left .el-tabs__header.is-right,
  .el-tabs--left .el-tabs__nav-scroll,
  .el-tabs--left .el-tabs__nav-wrap.is-left,
  .el-tabs--left .el-tabs__nav-wrap.is-right,
  .el-tabs--right .el-tabs__header.is-left,
  .el-tabs--right .el-tabs__header.is-right,
  .el-tabs--right .el-tabs__nav-scroll,
  .el-tabs--right .el-tabs__nav-wrap.is-left,
  .el-tabs--right .el-tabs__nav-wrap.is-right {
    height: auto;
  }
  .el-tabs__active-bar {
    display: none;
  }
  .el-tabs__nav-wrap::after {
    display: none;
  }
  .el-tabs__header {
    position: absolute;
    left: 200px;
    top: 300px;
    width: 285px;
  }
  .el-tabs__content {
    padding: 40px;
    text-align: left;
    p {
      font-size: 14px;
      line-height: 30px;
      color: #25415b;
    }
    ol {
      margin: 0 0 0 15px;
      padding: 0;
      li {
        font-size: 14px;
        color: #25415b;
        margin: 15px 0;
      }
    }
  }
  .el-tabs__item {
    font-size: 14px;
    color: #707f9d;
    &:hover,
    &.is-active {
      color: #ffffff;
      background: unset;
      &:before {
        content: "";
        width: 100%;
        background: url(../assets/about/tab-bg.png) no-repeat 0 0;
        height: 80px;
        background-size: contain;
        left: 5px;
        position: absolute;
        z-index: -1;
      }
    }
  }
  // .el-tabs__item.is-active {
  //   color: #ffffff;
  //   background: unset;
  //   &:before {
  //     content: "";
  //     width: 100%;
  //     background: url(../assets/about/tab-bg.png)no-repeat center center;
  //     width: 260px;
  //     height: 50px;
  //     background-size: contain;
  //     left: 5px;
  //     position: absolute;
  //     z-index: -1;
  //   }
  // }
  .help-content {
    border-bottom: 2px solid #2e343c;
    > p {
      font-size: 14px;
      line-height: 30px;
      color: #25415b;
    }
    ol {
      margin: 0 0 0 15px;
      padding: 0;
      li {
        font-size: 14px;
        color: #25415b;
        margin: 15px 0;
      }
    }
    .about-title {
      padding-top: 40px;
      font-size: 20px;
      border-bottom: 1px solid #d1d1d1;
      font-size: 22px;
      padding-bottom: 10px;
      &:first-child {
        padding-top: 0;
      }
    }
    .content-title {
      margin: 10px 0;
      font-size: 20px;
      color: #5665f2;
    }
  }
}
</style>
